---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathOfTravelFromRoom
source: html/d68ef52f-686e-7a80-73b8-2e3b5281214e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathOfTravelFromRoom Property

"From Room"

## Syntax (C#)
```csharp
public static ForgeTypeId PathOfTravelFromRoom { get; }
```